# Introduction to Pandas Workshop

# Installing Jupyter Notebooks
- Download Anaconda Navigator : https://www.anaconda.com/download 
- OR: 
- On Windows, try: 
    * pip install jupyter
    * jupyter notebook
    * If this doesnt work, you may not have pip installed or updated. Try this: 
    * python -m pip install --upgrade pip
    
- On Mac, try:
    * python3 -m ensurepip
    * pip3 install -- upgrade pip 
    * pip install jupyterlab 
    * command jupyter notebook

### What is Data Science
- I asked ChatGPT to give me a super simple explanation on what data science is: In beginner terms, data science is like a detective's job for the digital world. It involves using computer skills, statistics, and math to solve puzzles and gain insights from large sets of data.
- Basically, data science is the bridge between applied mathematics and computer science. We can use it to analyze large sets of data and make sense of them. We can also use programs and statistical concepts in order to gather inforamtion on the data or make future predictions over real-world scenarios.

### Why Pandas?
- Pandas helps us easily analyze large sets of data when a dataset is too large for a human to go through. 
- Pandas uses a dataframe system. A DataFrame is a type of data structure that uses two-demsnions and organizes data into a tabular format (rows and columns). 
- Pandas accepts multiple file formats: 
    - CSV
    - JSON
    - Text
    - Excel
    - etc. 
- relatively easy to learn and super applicable to data science
- Overall, Pandas is a data analysis and manipulation library in Python that uses dataframes in order to work with tabular data from datasets.

#### First we need to install Pandas:

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/neharajganesh/anaconda3/lib/python3.11/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/neharajganesh/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/neharajganesh/anaconda3/lib/python3.11/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in /Users/neharajganesh/anaconda3/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/neharajganesh/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

#### Import the library as alias "pd":

In [2]:
import pandas as pd

- Now we'll read the CSV file and give the full directory to where your file is saved in. This will convert the file into a Pandas DataFrame format. If the CSV file is saved in the same place as this Jupyter notebook, you can just put the file name "sections.csv."

In [3]:
df=pd.read_csv("/Users/neharajganesh/Desktop/archive/sections.csv")

In [4]:
df #This is what the dataframe looks like.

,semester,year,subject_code,course_number,section_number,a,b,c,d,f,...,diverse_3,diverse_4,diverse_5,diverse_0,feedback_1,feedback_2,feedback_3,feedback_4,feedback_5,feedback_6
0,FALL,2020,CEHD,603,600,10,0,0,0,0,...,0,2,3,0,0,0,0,0,3,2
1,FALL,2020,EDAD,601,600,4,3,0,0,0,...,2,2,2,0,0,0,0,2,2,2
2,FALL,2020,EDAD,606,700,10,0,0,0,0,...,2,0,3,0,0,0,0,0,3,4
3,FALL,2020,EDAD,608,700,42,1,0,0,2,...,2,6,11,1,1,0,2,0,11,11
4,FALL,2020,EDAD,608,701,9,0,0,0,0,...,1,1,2,0,0,0,0,0,1,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40718,FALL,2022,VTPB,927,300,63,62,23,0,0,...,4,13,28,5,1,0,3,10,16,23
40719,FALL,2022,VTPB,927,301,2,10,3,0,0,...,0,4,9,0,0,2,2,1,2,8
40720,FALL,2022,VTPB,930,300,96,49,3,0,0,...,4,18,20,3,0,0,0,3,18,26
40721,FALL,2022,VTPB,930,301,5,9,1,0,0,...,1,4,10,0,0,0,0,2,2,11
40722,FALL,2022,VTPB,948,302,57,3,0,0,0,...,5,9,7,0,1,1,2,9,3,5

### Loading and Inspection:

In [5]:
df.shape #shows you the number of rows and columns in your DataFrame

(40723, 51)

In [6]:
selected_columns = df.loc[:, ["subject_code","course_number","a","b","c","d","f","q"]]
print(selected_columns)

      subject_code  course_number   a   b   c  d  f  q
0             CEHD            603  10   0   0  0  0  0
1             EDAD            601   4   3   0  0  0  1
2             EDAD            606  10   0   0  0  0  0
3             EDAD            608  42   1   0  0  2  0
4             EDAD            608   9   0   0  0  0  0
...            ...            ...  ..  ..  .. .. .. ..
40718         VTPB            927  63  62  23  0  0  0
40719         VTPB            927   2  10   3  0  0  0
40720         VTPB            930  96  49   3  0  0  0
40721         VTPB            930   5   9   1  0  0  0
40722         VTPB            948  57   3   0  0  0  0

[40723 rows x 8 columns]

In [7]:
df = df.iloc[:,0:11] #indexing to see all rows and only first 11 columns 
df

,semester,year,subject_code,course_number,section_number,a,b,c,d,f,q
0,FALL,2020,CEHD,603,600,10,0,0,0,0,0
1,FALL,2020,EDAD,601,600,4,3,0,0,0,1
2,FALL,2020,EDAD,606,700,10,0,0,0,0,0
3,FALL,2020,EDAD,608,700,42,1,0,0,2,0
4,FALL,2020,EDAD,608,701,9,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
40718,FALL,2022,VTPB,927,300,63,62,23,0,0,0
40719,FALL,2022,VTPB,927,301,2,10,3,0,0,0
40720,FALL,2022,VTPB,930,300,96,49,3,0,0,0
40721,FALL,2022,VTPB,930,301,5,9,1,0,0,0
40722,FALL,2022,VTPB,948,302,57,3,0,0,0,0

In [8]:
print(df.columns) #These are the columns in our dataset after using the iloc function.

Index(['semester', 'year', 'subject_code', 'course_number', 'section_number',
       'a', 'b', 'c', 'd', 'f', 'q'],
      dtype='object')

In [9]:
df.head(5)

  semester  year subject_code  course_number section_number   a  b  c  d  f  q
0     FALL  2020         CEHD            603            600  10  0  0  0  0  0
1     FALL  2020         EDAD            601            600   4  3  0  0  0  1
2     FALL  2020         EDAD            606            700  10  0  0  0  0  0
3     FALL  2020         EDAD            608            700  42  1  0  0  2  0
4     FALL  2020         EDAD            608            701   9  0  0  0  0  0

In [10]:
df.tail(5)

,semester,year,subject_code,course_number,section_number,a,b,c,d,f,q
40718,FALL,2022,VTPB,927,300,63,62,23,0,0,0
40719,FALL,2022,VTPB,927,301,2,10,3,0,0,0
40720,FALL,2022,VTPB,930,300,96,49,3,0,0,0
40721,FALL,2022,VTPB,930,301,5,9,1,0,0,0
40722,FALL,2022,VTPB,948,302,57,3,0,0,0,0

In [11]:
filtered_df = df[(df['subject_code'] == "CHEM")]
filtered_df

,semester,year,subject_code,course_number,section_number,a,b,c,d,f,q
4408,FALL,2020,CHEM,100,500,89,18,2,2,1,2
4409,FALL,2020,CHEM,107,503,31,17,8,0,1,1
4410,FALL,2020,CHEM,107,504,79,84,37,7,6,12
4411,FALL,2020,CHEM,107,505,81,84,32,8,7,5
4412,FALL,2020,CHEM,107,506,82,91,36,9,3,6
...,...,...,...,...,...,...,...,...,...,...,...
34661,FALL,2022,CHEM,644,600,4,6,0,0,0,0
34662,FALL,2022,CHEM,646,600,13,11,1,0,0,0
34663,FALL,2022,CHEM,648,600,6,6,0,0,0,0
34664,FALL,2022,CHEM,658,600,8,0,0,0,0,0
34665,FALL,2022,CHEM,689,601,9,5,0,0,0,2

In [12]:
df.info() #gives you a summary of the DataFrame's structure.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40723 entries, 0 to 40722
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   semester        40723 non-null  object
 1   year            40723 non-null  int64
 2   subject_code    40723 non-null  object
 3   course_number   40723 non-null  int64
 4   section_number  40723 non-null  object
 5   a               40723 non-null  int64
 6   b               40723 non-null  int64
 7   c               40723 non-null  int64
 8   d               40723 non-null  int64
 9   f               40723 non-null  int64
 10  q               40723 non-null  int64
dtypes: int64(8), object(3)
memory usage: 3.4+ MB

In [13]:
print(df[(df['subject_code'] == 'CHEM') & (df['course_number'] == '107')])

Empty DataFrame
Columns: [semester, year, subject_code, course_number, section_number, a, b, c, d, f, q]
Index: []

In [14]:
print(df[(df['subject_code'] == "CHEM") & (df['course_number'] == 107)])

      semester  year subject_code  course_number section_number    a    b  \
4409      FALL  2020         CHEM            107            503   31   17
4410      FALL  2020         CHEM            107            504   79   84
4411      FALL  2020         CHEM            107            505   81   84
4412      FALL  2020         CHEM            107            506   82   91
4413      FALL  2020         CHEM            107            507  256  238
4414      FALL  2020         CHEM            107            508  243  220
4415      FALL  2020         CHEM            107            509   24   10
4416      FALL  2020         CHEM            107            M01    3    5
9736    SPRING  2021         CHEM            107            500    3    1
9737    SPRING  2021         CHEM            107            501   49  106
9738    SPRING  2021         CHEM            107            502   42   86
9739    SPRING  2021         CHEM            107            M01    4    7
16152   SUMMER  2021         CHEM            107            300   11   28
21340     FALL  2021         CHEM            107            501  160  125
21341     FALL  2021         CHEM            107            502  153   99
21342     FALL  2021         CHEM            107            503  166  111
21343     FALL  2021         CHEM            107            504  147  116
21344     FALL  2021         CHEM            107            505  151  117
21345     FALL  2021         CHEM            107            506  172  121
21346     FALL  2021         CHEM            107            M01    9    3
24408   SPRING  2022         CHEM            107            501  103  236
24409   SPRING  2022         CHEM            107            M01    5    9
32166   SUMMER  2022         CHEM            107            300    5    8
32167   SUMMER  2022         CHEM            107            M01    1    1
34203     FALL  2022         CHEM            107            501  230  176
34204     FALL  2022         CHEM            107            502  255  190
34205     FALL  2022         CHEM            107            503  126   91
34206     FALL  2022         CHEM            107            504  127   97
34207     FALL  2022         CHEM            107            505  127   94
34208     FALL  2022         CHEM            107            506  248  225
34209     FALL  2022         CHEM            107            M01    5    2

         c   d   f   q
4409     8   0   1   1
4410    37   7   6  12
4411    32   8   7   5
4412    36   9   3   6
4413   107  15   9  16
4414   110  24  13   7
4415     3   0   0   0
4416     2   1   1   0
9736     2   0   0   1
9737    46   2  12  22
9738    44   2  11  30
9739     2   0   4   0
16152   15   4   2   2
21340   45  11   5  21
21341   64  13   8  18
21342   45   5   8  20
21343   63   9   5  16
21344   61  10   5  19
21345   52   8   4  12
21346    3   2   0   3
24408  122  29  17  37
24409   12   2   3  13
32166    5   3   2   4
32167    3   2   0   0
34203   71  17  14  29
34204   75   9   8  23
34205   29   8   6  14
34206   32   5   2  12
34207   40   8   1  11
34208   57   8   6  12
34209    5   4   0   2

In [15]:
ascending_df = df.sort_values(by='a', ascending=True) #prints in ascending order
print(ascending_df)

      semester  year subject_code  course_number section_number    a    b   c  \
25847   SPRING  2022         ENGR            217            551    0    3   3
39079     FALL  2022         CVEN            365            507    0    5   7
26574   SPRING  2022         MMET            206            501    0    6   4
4273      FALL  2020         BIOL            111            M02    0    7   4
10841   SPRING  2021         MEMA            613            600    0    2   2
...        ...   ...          ...            ...            ...  ...  ...  ..
22944     FALL  2021         HLTH            354            599  549  186  21
33214     FALL  2022         ISTM            209            599  550  273  86
1108      FALL  2020         ISTM            209            599  567  258  91
35133     FALL  2022         GEOG            203            599  610  101  44
36837     FALL  2022         ANSC            107            700  643   84  19

        d   f   q
25847   0   0   0
39079   2   0   0
26574   0   0   3
4273    1   3   0
10841   1   0   0
...    ..  ..  ..
22944   4   4   2
33214  15  15  44
1108   18  11   5
35133   7   7   6
36837  11   9   1

[40723 rows x 11 columns]

In [16]:
descending_df = df.sort_values(by='a', ascending=False) #prints in descending order
print(descending_df)

      semester  year subject_code  course_number section_number    a    b   c  \
36837     FALL  2022         ANSC            107            700  643   84  19
35133     FALL  2022         GEOG            203            599  610  101  44
1108      FALL  2020         ISTM            209            599  567  258  91
33214     FALL  2022         ISTM            209            599  550  273  86
22944     FALL  2021         HLTH            354            599  549  186  21
...        ...   ...          ...            ...            ...  ...  ...  ..
21807     FALL  2021         NRSC            401            500    0    3   1
6619      FALL  2020         ESET            350            506    0    2   2
40141     FALL  2022         MMET            380            906    0    5   4
12139   SPRING  2021         MSEN            400            504    0    5   4
26697   SPRING  2022         MMET            410            504    0    7   2

        d   f   q
36837  11   9   1
35133   7   7   6
1108   18  11   5
33214  15  15  44
22944   4   4   2
...    ..  ..  ..
21807   1   0   0
6619    5   0   2
40141   1   0   3
12139   0   0   0
26697   0   0   0

[40723 rows x 11 columns]

#### *Exercise: Which course has the highest number of q-drops altogether in this dataset? (Use the functions above to solve.)

In [17]:
value_counts = df['subject_code'].value_counts()
print(value_counts)

CHEM    2194
MATH    1634
KINE    1516
PHYS    1375
BIOL    1335
        ...
DASC       2
EURO       2
FORS       1
DHUM       1
WMHS       1
Name: subject_code, Length: 206, dtype: int64
Count of 'Math101': 1634

### Calculation:

In [18]:
df.describe() #gives you statisical values of the overall dataset

,year,course_number,a,b,c,d,f,q
count,40723.000000,40723.000000,40723.000000,40723.000000,40723.000000,40723.000000,40723.000000,40723.000000
mean,2021.212681,356.600447,17.873831,9.089802,3.754758,0.793532,0.514992,1.255679
std,0.745548,201.616986,27.270495,16.018555,8.781916,2.371443,1.362617,3.623954
min,2020.000000,100.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2021.000000,210.000000,6.000000,2.000000,0.000000,0.000000,0.000000,0.000000
50%,2021.000000,323.000000,11.000000,5.000000,1.000000,0.000000,0.000000,0.000000
75%,2022.000000,460.000000,19.000000,10.000000,4.000000,1.000000,1.000000,1.000000
max,2022.000000,4820.000000,643.000000,728.000000,360.000000,111.000000,55.000000,147.000000

In [19]:
math_151 = df[(df['subject_code'] == 'MATH') & (df['course_number'] == 151)] 
math_151.describe()

,year,course_number,a,b,c,d,f,q
count,284.000000,284.0,284.000000,284.000000,284.000000,284.000000,284.000000,284.00000
mean,2021.147887,151.0,12.126761,9.225352,5.602113,1.524648,1.232394,1.68662
std,0.818921,0.0,6.222448,3.490308,3.136494,1.415247,1.677814,2.13759
min,2020.000000,151.0,0.000000,1.000000,0.000000,0.000000,0.000000,0.00000
25%,2020.000000,151.0,8.000000,7.000000,3.000000,0.000000,0.000000,0.00000
50%,2021.000000,151.0,12.000000,9.000000,5.000000,1.000000,1.000000,1.00000
75%,2022.000000,151.0,16.250000,12.000000,7.000000,2.000000,2.000000,2.00000
max,2022.000000,151.0,33.000000,19.000000,25.000000,7.000000,13.000000,12.00000

#### *Exercise: Try to find the stats over one of your current TAMU courses.

In [20]:
df_dropdf = df.drop('year', axis=1)
df_dropdf

      semester subject_code  course_number section_number   a   b   c  d  f  q
0         FALL         CEHD            603            600  10   0   0  0  0  0
1         FALL         EDAD            601            600   4   3   0  0  0  1
2         FALL         EDAD            606            700  10   0   0  0  0  0
3         FALL         EDAD            608            700  42   1   0  0  2  0
4         FALL         EDAD            608            701   9   0   0  0  0  0
...        ...          ...            ...            ...  ..  ..  .. .. .. ..
40718     FALL         VTPB            927            300  63  62  23  0  0  0
40719     FALL         VTPB            927            301   2  10   3  0  0  0
40720     FALL         VTPB            930            300  96  49   3  0  0  0
40721     FALL         VTPB            930            301   5   9   1  0  0  0
40722     FALL         VTPB            948            302  57   3   0  0  0  0

[40723 rows x 10 columns]

In [21]:
result = df.groupby('semester')['q'].sum()
print(result)

semester
FALL      27454
SPRING    22036
SUMMER     1645
Name: q, dtype: int64

In [22]:
result = df.groupby('semester')['q'].mean()
print(result)

semester
FALL      1.172046
SPRING    1.492145
SUMMER    0.649941
Name: q, dtype: float64

### Manipulation

In [23]:
df.isnull()

,semester,year,subject_code,course_number,section_number,a,b,c,d,f,q
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
40718,False,False,False,False,False,False,False,False,False,False,False
40719,False,False,False,False,False,False,False,False,False,False,False
40720,False,False,False,False,False,False,False,False,False,False,False
40721,False,False,False,False,False,False,False,False,False,False,False
40722,False,False,False,False,False,False,False,False,False,False,False

In [24]:
filter_df = df[df.isnull().any(axis=1)]
print(filter_df)

Empty DataFrame
Columns: [semester, year, subject_code, course_number, section_number, a, b, c, d, f, q]
Index: []

#There are no missing dataframes in this set of data.

In [25]:
df.duplicated() #no duplicated values either, this a good dataset!

0        False
1        False
2        False
3        False
4        False
         ...
40718    False
40719    False
40720    False
40721    False
40722    False
Length: 40723, dtype: bool

In [26]:
dirty_dummy_df = df.replace(to_replace=["CHEM", "EDAD"],
            value=None,
            inplace=False)

In [27]:
print(dirty_dummy_df['subject_code'].isna().sum()) # shows how many na in specific column

2316

In [28]:
print(dirty_dummy_df.isna().sum()) # shows how many na in each column

semester             0
year                 0
subject_code      2316
course_number        0
section_number       0
a                    0
b                    0
c                    0
d                    0
f                    0
q                    0
dtype: int64

In [29]:
print(dirty_dummy_df.isna().sum().sum()) # total number of na in entire dataframe

2316

In [30]:
clean_rows_dummy_df = dirty_dummy_df.dropna(inplace=False) # drop the rows where at least one element is missing
print(clean_rows_dummy_df)

      semester  year subject_code  course_number section_number   a   b   c  \
0         FALL  2020         CEHD            603            600  10   0   0
20        FALL  2020         EHRD            203            200   7   0   0
21        FALL  2020         EHRD            203            501  20   6   3
22        FALL  2020         EHRD            203            502  24  12   1
23        FALL  2020         EHRD            203            598  31   9   1
...        ...   ...          ...            ...            ...  ..  ..  ..
40718     FALL  2022         VTPB            927            300  63  62  23
40719     FALL  2022         VTPB            927            301   2  10   3
40720     FALL  2022         VTPB            930            300  96  49   3
40721     FALL  2022         VTPB            930            301   5   9   1
40722     FALL  2022         VTPB            948            302  57   3   0

       d  f  q
0      0  0  0
20     0  0  0
21     1  0  0
22     1  0  0
23     0  0  0
...   .. .. ..
40718  0  0  0
40719  0  0  0
40720  0  0  0
40721  0  0  0
40722  0  0  0

[38407 rows x 11 columns]

In [31]:
clean_cols_dummy_df = dirty_dummy_df.dropna(axis='columns', inplace=False) # drop the columns where at least one element is missing
print(clean_cols_dummy_df)

      semester  year  course_number section_number   a   b   c  d  f  q
0         FALL  2020            603            600  10   0   0  0  0  0
1         FALL  2020            601            600   4   3   0  0  0  1
2         FALL  2020            606            700  10   0   0  0  0  0
3         FALL  2020            608            700  42   1   0  0  2  0
4         FALL  2020            608            701   9   0   0  0  0  0
...        ...   ...            ...            ...  ..  ..  .. .. .. ..
40718     FALL  2022            927            300  63  62  23  0  0  0
40719     FALL  2022            927            301   2  10   3  0  0  0
40720     FALL  2022            930            300  96  49   3  0  0  0
40721     FALL  2022            930            301   5   9   1  0  0  0
40722     FALL  2022            948            302  57   3   0  0  0  0

[40723 rows x 10 columns]

In [32]:
filtered_dirty_df = dirty_dummy_df[dirty_dummy_df.isnull().any(axis=1)] # same command from above
print(filtered_dirty_df)

      semester  year subject_code  course_number section_number   a  b  c  d  \
1         FALL  2020         None            601            600   4  3  0  0
2         FALL  2020         None            606            700  10  0  0  0
3         FALL  2020         None            608            700  42  1  0  0
4         FALL  2020         None            608            701   9  0  0  0
5         FALL  2020         None            610            600  17  0  0  0
...        ...   ...          ...            ...            ...  .. .. .. ..
38095     FALL  2022         None            655            600  16  1  0  0
38096     FALL  2022         None            669            600  11  2  0  0
38097     FALL  2022         None            683            600   9  0  0  0
38098     FALL  2022         None            688            600  14  0  0  0
38099     FALL  2022         None            689            602   4  1  0  0

       f  q
1      0  1
2      0  0
3      2  0
4      0  0
5      0  0
...   .. ..
38095  0  0
38096  0  0
38097  0  0
38098  0  0
38099  0  1

[2316 rows x 11 columns]

In [33]:
filled_dummy_df = dirty_dummy_df.fillna(value="UNKNOWN", inplace=False) # replaces all NA values with given value, can be more specific
print(filled_dummy_df)

      semester  year subject_code  course_number section_number   a   b   c  \
0         FALL  2020         CEHD            603            600  10   0   0
1         FALL  2020      UNKNOWN            601            600   4   3   0
2         FALL  2020      UNKNOWN            606            700  10   0   0
3         FALL  2020      UNKNOWN            608            700  42   1   0
4         FALL  2020      UNKNOWN            608            701   9   0   0
...        ...   ...          ...            ...            ...  ..  ..  ..
40718     FALL  2022         VTPB            927            300  63  62  23
40719     FALL  2022         VTPB            927            301   2  10   3
40720     FALL  2022         VTPB            930            300  96  49   3
40721     FALL  2022         VTPB            930            301   5   9   1
40722     FALL  2022         VTPB            948            302  57   3   0

       d  f  q
0      0  0  0
1      0  0  1
2      0  0  0
3      0  2  0
4      0  0  0
...   .. .. ..
40718  0  0  0
40719  0  0  0
40720  0  0  0
40721  0  0  0
40722  0  0  0

[40723 rows x 11 columns]

In [34]:
#Total People in each Section of Course (let's add a column):
df['Total People in Section']=df.iloc[:,5:11].sum(axis=1)
df.head(5)

,semester,year,subject_code,course_number,section_number,a,b,c,d,f,q,Total People in Section
0,FALL,2020,CEHD,603,600,10,0,0,0,0,0,10
1,FALL,2020,EDAD,601,600,4,3,0,0,0,1,8
2,FALL,2020,EDAD,606,700,10,0,0,0,0,0,10
3,FALL,2020,EDAD,608,700,42,1,0,0,2,0,45
4,FALL,2020,EDAD,608,701,9,0,0,0,0,0,9

#### *Final Exercise: Group the dataframe by the subject code and find the sum of each letter grade. Then, print the values of the sums for your TAMU course of choice.

In [35]:
#Hint to get started:
result = df.groupby('subject_code')['q'].sum()
print(result)

subject_code
ACCT    1821
AEGD       0
AERO     671
AERS       5
AFST      24
        ...
VTPB      41
VTPP     164
WFSC     195
WGST     104
WMHS       0
Name: q, Length: 206, dtype: int64

## Sources:
- https://www.datacamp.com/tutorial/pandas
- https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf